lib/tasks/dev.rake

SELECT  "tipomineracaos".* FROM "tipomineracaos" WHERE "tipomineracaos"."sigla" = ? LIMIT ?  [["sigla", "PoW"], ["LIMIT", 1]]
SELECT "tipomineracaos".* FROM "tipomineracaos"
SELECT  "tipomineracaos".* FROM "tipomineracaos" WHERE "tipomineracaos"."descricao" = ? AND "tipomineracaos"."sigla" = ? LIMIT ?  [["descricao", "Proof of Work"], ["sigla", "PoW"], ["LIMIT", 1]]
INSERT INTO "moedas" ("descricao", "sigla", "imagem", "created_at", "updated_at", "tipomineracao_id") VALUES (?, ?, ?, ?, ?, ?)
---
  task add_coins: :environment do
  moedas = [
      {
          descricao: "Bitcoin",
          sigla: "BTC",
          imagem: "https://www.kindpng.com/picc/m/257-2575803_bitcoin-blockchain-icon-golden-internet-coin-bitcoin-icon.png",
          tipomineracao_id: Tipomineracao.find_by(sigla: 'PoW').id
      },

      {
          descricao: "Etherium",
          sigla: "ETH",
          imagem: "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/ETHEREUM-YOUTUBE-PROFILE-PIC.png/600px-ETHEREUM-YOUTUBE-PROFILE-PIC.png",
          tipomineracao_id: Tipomineracao.all.sample.id
      },

      {
          descricao: "Litecoin",
          sigla: "LC",
          imagem: "https://pbs.twimg.com/profile_images/498948297805946880/h58GUeGf_400x400.png",
          tipomineracao_id: Tipomineracao.all.sample.id
      },

      {
          descricao: "Dash",
          sigla: "DASH",
          imagem: "https://cryptowiki.net/images/5/55/Dash.png",
          tipomineracao_id: Tipomineracao.all.sample.id
      },
      {
          descricao: "Iota",
          sigla: "IOT",
          imagem: "https://guiadobitcoin.com.br/wp-content/uploads/2017/12/iota-png.png",
          tipomineracao_id: Tipomineracao.all.sample.id
      },
      {
          descricao: "ZCash",
          sigla: "ZEC",
          imagem: "https://s2.coinmarketcap.com/static/img/coins/200x200/1437.png",
          tipomineracao_id: Tipomineracao.all.sample.id
      }
  ]


  moedas.each do |moeda|
    Moeda.find_or_create_by!(moeda)

INSERT INTO "tipomineracaos" ("descricao", "sigla", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["descricao", "Proof of Work"], ["sigla", "PoW"], ["created_at", "2020-05-03 02:07:32.723964"], ["updated_at", "2020-05-03 02:07:32.723964"]]
---
  task add_mining_types: :environment do

    tipos_mineracao = [
        {descricao: "Proof of Work" , sigla: "PoW"},
        {descricao: "Proof of Stake" , sigla: "PoS"},
        {descricao: "Proof of Capacity" , sigla: "PoC"}
    ]

    tipos_mineracao.each do |tipo|
      Tipomineracao.find_or_create_by!(tipo)