app/controllers/moedas_controller.rb

  def index
    @moedas = Moeda.all
---
SELECT  "moedas".* FROM "moedas" ORDER BY "moedas"."id" DESC LIMIT ?  [["LIMIT", 1]]

  def create

    @moeda = Moeda.new(moeda_params)

    respond_to do |format|
      if @moeda.save
---
INSERT INTO "moedas" ("descricao", "sigla", "imagem", "created_at", "updated_at", "tipomineracao_id") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @moeda.update(moeda_params)
---
UPDATE "moedas" SET "tipomineracao_id" = ?, "updated_at" = ? WHERE "moedas"."id" = ?  [["tipomineracao_id", 2], ["updated_at", "2020-05-12 02:25:11.411699"], ["id", 1]]

  def destroy
    @classe_sucess = 'alert alert-success'
    @moeda.destroy
---
DELETE FROM "moedas" WHERE "moedas"."id" = ?  [["id", 22]]

    def set_moeda
      @moeda = Moeda.find(params[:id])
---
SELECT  "moedas".* FROM "moedas" WHERE "moedas"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]

  def set_mining_type_options
    @mining_type_options = Tipomineracao.all.pluck(:descricao, :id);
---
SELECT "tipomineracaos"."descricao", "tipomineracaos"."id" FROM "tipomineracaos"