app/controllers/tipomineracaos_controller.rb

SELECT "tipomineracaos".* FROM "tipomineracaos"
---
  def index
    @tipomineracaos = Tipomineracao.all

INSERT INTO "tipomineracaos" ("descricao", "sigla", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["descricao", "Teste"], ["sigla", "TT"], ["created_at", "2020-05-04 03:09:40.977839"], ["updated_at", "2020-05-04 03:09:40.977839"]]
---
  def create
    @tipomineracao = Tipomineracao.new(tipomineracao_params)

    respond_to do |format|
      if @tipomineracao.save

UPDATE "tipomineracaos" SET "sigla" = ?, "updated_at" = ? WHERE "tipomineracaos"."id" = ?  [["sigla", "PoW"], ["updated_at", "2020-05-02 03:54:54.229205"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @tipomineracao.update(tipomineracao_params)

SELECT  "tipomineracaos".* FROM "tipomineracaos" WHERE "tipomineracaos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_tipomineracao
      @tipomineracao = Tipomineracao.find(params[:id])